// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.

// Например, даны 2 матрицы:
// 2 4 | 3 4
// 3 2 | 3 3
// Результирующая матрица будет:
// 18 20
// 15 18

/*
C[0,0] = 18 # = 2 4 | 3 #      C[0,0] += A[0,i] * B[i,0]; i++
          # #   # # | 3 #      C[0,0] += A[0,i] * B[i,0] 

C[0,1] = # 20 = 2 4 | # 4      C[0,1] += A[0,i] * B[i,1]; i++
         # #    # # | # 3      C[0,1] += A[0,i] * B[i,1] 

          # #   # # | 3 #      C[1,0] += A[1,i] * B[i,0]; i++
C[1,0] = 15 # = 3 2 | 3 #      C[1,0] += A[1,i] * B[i,0]
*/



