# --------------------------------------------------------------УСЛОВИЕ------------------------------------------------------------------------------

# В фермерском хозяйстве в Карелии выращивают чернику. Черника растет на круглой грядке, и кусты черники высажены по окружности грядки. 
# Каждый куст черники имеет урожайность, которая соответствует количеству ягод на этом кусте.

# Урожайность черничных кустов представлена в виде списка arr, где arr[i] - это урожайность (количество ягод) i-го куста.

# В фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Каждый собирающий модуль может собрать ягоды с одного куста и с двух соседних кустов. Собирающий модуль находится перед определенным кустом, 
# и он может выбирать, с какого куста начать сбор ягод.

# -------------------------------------------------------------ЗАДАЧА_24-----------------------------------------------------------------------------

# Ваша задача - написать программу, которая определит максимальное число ягод, которое может собрать один собирающий модуль за один заход, 
# находясь перед некоторым кустом грядки.

# Входные данные:

# На вход программе подается список arr, где arr[i] (1 ≤ arr[i] ≤ 1000) - урожайность i-го куста черники. Размер списка не превышает 1000 элементов.

# Выходные данные:

# Программа должна вывести одно целое число - максимальное количество ягод, которое может собрать собирающий модуль, 
# находясь перед некоторым кустом грядки.

# Input:    arr = [5, 8, 6, 4, 9, 2, 7, 3]

# Output:    19

# -------------------------------------------------------------МОЁ_РЕШЕНИЕ---------------------------------------------------------------------------

bush = [5, 8, 6, 4, 9, 2, 7, 3]    # arr = 

harvest = list()
collector_size = 3

for startIndex in range(-(collector_size - 1), len(bush) - (collector_size - 1)): #  ИЗМЕНИЛ for startIndex in range(len(bush) - 2): ПОСЛЕ ПРОСМОТРА "РЕШЕНИЯ" НА:
    gather = 0                                                                    #                                        ^ 
    for i in range(startIndex, startIndex + collector_size):                      #                               (-2, len(bush) - 2)
        gather += bush[i]
    harvest.append(gather)

print(max(harvest))


# -------------------------------------------------------------РЕШЕНИЕ_КУРСА-------------------------------------------------------------------------

# bush = [5, 8, 6, 4, 9, 2, 7, 3]    # arr = 

# harvest = list()

# for i in range(len(bush) - 1):
#     harvest.append(bush[i - 1] + bush[i] + bush[i + 1])
# harvest.append(bush[-2] + bush[-1] + bush[0])

# print(harvest)